# PRACTICAL QUES 8

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
data =pd.read_csv('data10.csv')

   Name  Gender  MonthlyIncome
0   NaN     NaN            NaN
1   NaN     NaN            NaN
2   NaN     NaN            NaN
3   NaN     NaN            NaN
4   NaN     NaN            NaN

In [4]:
family.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           10 non-null     object
 1   Gender         10 non-null     object
 2   MonthlyIncome  10 non-null     float64
dtypes: float64(1), object(2)
memory usage: 368.0+ bytes

## PART A

In [5]:
familywise = family.groupby('Name')
familywise.describe().transpose()

Name                         Kumar           Shah           Vats
MonthlyIncome count       3.000000       3.000000       4.000000
              mean    84510.000000   93800.000000   83762.500000
              std     17018.968829   33611.307621   49047.279486
              min     69500.000000   55000.000000   43150.000000
              25%     75265.000000   83700.000000   59537.500000
              50%     81030.000000  112400.000000   68450.000000
              75%     92015.000000  113200.000000   92675.000000
              max    103000.000000  114000.000000  155000.000000

In [6]:
familywise.sum()

       MonthlyIncome
Name
Kumar       253530.0
Shah        281400.0
Vats        335050.0

## PART B

In [7]:
familywise.max()

      Gender  MonthlyIncome
Name
Kumar   Male       103000.0
Shah    Male       114000.0
Vats    Male       155000.0

## PART C

In [5]:
family[family['MonthlyIncome']>60000]

    Name   Gender  MonthlyIncome
0   Shah     Male       114000.0
1   Vats     Male        65000.0
3  Kumar  Female         69500.0
4   Vats   Female       155000.0
5  Kumar     Male       103000.0
7   Shah   Female       112400.0
8  Kumar   Female        81030.0
9   Vats     Male        71900.0

## PART D

In [7]:
family[family['Gender']=='Female'].groupby('Name').mean().loc['Shah']

MonthlyIncome    112400.0
Name: Shah, dtype: float64